app/controllers/students_controller.rb

INSERT INTO "students" ("name", "email", "department", "phone", "roll_no", "vehicle_no", "adhar_no", "license", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

UPDATE "students" SET "updated_at" = ? WHERE "students"."id" = ?  [["updated_at", "2022-09-08 08:09:17.557895"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @student.update(student_params)